RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_04.svd
&lt;0&gt;: Active Mode Duty Cycle enable for SAR0
&lt;1&gt;: Active Mode Duty Cycle enable for SAR1
&lt;2&gt;: Active Mode Duty Cycle enable for SAR2
&lt;3&gt;: Active Mode Duty Cycle enable for SAR3

This field is only applicable when SAR_CLOCK_SEL.CLOCK_SEL =1.

This field can also affect LPOSC functionality in Active Mode (see LPOSC CONFIG.DEEPSLEEP_MODE field for details)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTBM_CLOCK_SEL</name>
          <description>Clock select for CTBm</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PUMP_CLOCK_SEL</name>
              <description>Select source for CTBm Pump Clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>CTBm pump clock set by AREF.CTRL.CLOCK_PUMP_PERI_SEL (Legacy).

When configured for legacy operation, the CTBm deeplseep functionality is determined solely by the CTRL.DEEPSLEEP_ON bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DPSLP</name>
                  <description>CTBm pump clock sourced from CLK_DPSLP

When configured for CLK_DPSLP operation, the CTBm deepsleep functionality is determined by the CTRL.DEEPSLEEP_ON bit AND SAR(s) operation (i.e. CTBm is duty cycled with the SAR(s)).  In this mode, the CTBm should only be used as a buffer/gain stage for the SAR(s).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>SAR_DPSLP_CTRL[%s]</name>
          <description>Deepsleep control for SARv3</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>enable for SAR deepsleep operation.  SAR_CLOCK_SEL.CLOCK_SEL must be set to 1 for this field to affect SAR operation.

- 0: SAR deeepsleep operation disabled
- 1: SAR deepsleep operation enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>SAR_CLOCK_SEL[%s]</name>
          <description>Clock select for SARv3</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>CLOCK_SEL</name>
              <description>SAR clock select</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>- 0: legacy: SAR clock source is CLK_PERI (SAR is only operational in chip ACTIVE mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DPSLP</name>
                  <description>- 1: SAR clock source is CLK_DPSLP (SAR can be operational in both chip ACTIVE and DEEPSLEEP modes)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>SAR_TR_SCAN_CNT_STATUS[%s]</name>
          <description>SAR trigger scan control status</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SCAN_CNT_STATUS</name>
              <description>A read from this register returns the current sample count (possible values are 1 through SCAN_TR_SCAN_CNT.SCAN_CNT+1). This field cannot be read if SAR_CLOCK_SEL.CLOCK_SEL =1.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TR_SCAN_CNT</name>
          <description>SAR trigger scan control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SCAN_CNT</name>
              <description>SAR trigger sample counter. This field determines the number of samples a SAR will take when triggered.  The number of samples is SCAN_COUNT+1.

This feature can be enabled for individual SARs by setting the appropriate bit of SAR_TR_CTRL.TR_SCAN_CNT_SEL.

This feature can be enabled for simultaneously sampled SARs by setting SAR_SIMULT_TR_CTRL.SIMULT_TR_SCAN_CNT_SEL.

If SAR.SAMPLE_CTRL.AVG_MODE is set to INTERLEAVED, the SCAN_CNT must be set an integer multiple of  (1&lt;&lt;AVG_CNTR+1).</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_OVR_CTRL</name>
          <description>SAR HW trigger override</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>HW_TR_TIMER_SEL</name>
              <description>SAR hardware trigger source select (one bit per SAR). SAR must be configured for hardware triggering (SAR.SAMPLE_CTRL.DSI_TRIGGER_EN must be set to 1).

-0: Legacy (tr_sar_in_&lt;N&gt;)
-1: Timer trigger

