RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_04.svd
&lt;0&gt;: HW Trigger source for SAR0
&lt;1&gt;: HW Trigger source for SAR1
&lt;2&gt;: HW Trigger source for SAR2
&lt;3&gt;: HW Trigger source for SAR3</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TR_SCAN_CNT_SEL</name>
              <description>SAR trigger sample select (one bit per SAR).

-0: Disabled
-1: Enabled, SAR takes SAR_TR_SCAN_CNT per trigger (valid for both Firmware and Edge Senstive Hardware triggering, but ignored for Level Sensitive Hardware triggering and CONTINUOUS triggering).  This feature cannot be enabled if the SAR is configured for Non-Tailgating Injection (SAR.INJ_CHAN_CONFIG.INJ_TAILGATING=0 while SAR.INJ_CHAN_CONFIG.INJ_START_EN=1)

&lt;0&gt;: trigger sample select for SAR0
&lt;1&gt;: trigger sample select for SAR1
&lt;2&gt;: trigger sample select for SAR2
&lt;3&gt;: trigger sample select for SAR3</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS_INTR_SCAN_CNT_SEL</name>
              <description>SAR EOS interrupt source select (one bit per SAR).  This feature is not available for FW or Continuous triggering.

-0: Legacy (SAR EOS is the source of the SAR EOS interrupt)
-1: Enabled, SAR EOS interrupt only occurs for the EOS when sample=SAR_TR_SCAN_CNT.SCAN_CNT.

&lt;0&gt;: EOS interrupt sample count select for SAR0
&lt;1&gt;: EOS interrupt sample count select for SAR1
&lt;2&gt;: EOS interrupt sample count select for SAR2
&lt;3&gt;: EOS interrupt sample count select for SAR3</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SIMULT_CTRL</name>
          <description>SAR simultaneous trigger control</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0x3C013F</resetMask>
          <fields>
            <field>
              <name>SIMULT_HW_TR_EN</name>
              <description>SAR simultaneous hardware triggering enable (one bit per SAR)
-0: disabled
-1: SAR trigger override enabled (SAR trigger set by SAR_OVR_CTRL register)

&lt;0&gt;: Simultaneuous sampling enable for SAR0
&lt;1&gt;: Simultaneuous sampling enable for SAR1
&lt;2&gt;: Simultaneuous sampling enable for SAR2
&lt;3&gt;: Simultaneuous sampling enable for SAR3

Simultaneous sampling requires at least two bits in this field to be set.
If less than two bits are set, this register will not affect SAR operation.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMULT_HW_TR_SRC</name>
              <description>Source for Simult Hardware trigger</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAR_TR_IN_0</name>
                  <description>SAR 0 HW Trigger Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAR_TR_IN_1</name>
                  <description>SAR 1 HW Trigger Input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAR_TR_IN_2</name>
                  <description>SAR 2 HW Trigger Input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAR_TR_IN_3</name>
                  <description>SAR 3 HW Trigger Input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMULT_HW_TR_TIMER_SEL</name>
              <description>SAR hardware trigger source select
-0: SIMULT_HW_TR_SRC
-1: Timer trigger</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMULT_HW_TR_LEVEL</name>
              <description>- 0: trigger signal is a pulse input, a positive edge detected on the trigger signal triggers a new scan.
- 1: trigger signal is a level input, as long as the trigger signal remains high the SAR will do continuous scans. This field cannot be set when SAR_CLOCK_SEL.CLOCK_SEL =1.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMULT_HW_SYNC_TR</name>
              <description>- 0: bypass clock domain synchronization of the Simult trigger signal.
- 1: synchronize the Simult trigger signal to the SAR clock domain, if needed an edge detect is done in the peripheral clock domain.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMULT_TR_SCAN_CNT_SEL</name>
              <description>Simultaneous trigger sample select
-0: Disabled
-1: Enabled, SAR takes SAR_TR_SCAN_CNT per trigger (valid for both Firmware and Edge Senstive Hardware triggering, but ignored for Level Sensitive Hardware triggering and CONTINUOUS triggering) This feature cannot be enabled if either SAR is configured for Non-Tailgating Injection (SAR.INJ_CHAN_CONFIG.INJ_TAILGATING=0 while SAR.INJ_CHAN_CONFIG.INJ_START_EN=1)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMULT_EOS_INTR_SCAN_CNT_SEL</name>
              <description>Simultaneous SAR EOS interrupt source select.  This feature is not available for FW or Continuous triggering.

-0: Legacy (SAR EOS is the source of the SAR EOS interrupt)
-1: Enabled, SAR EOS interrupt only occurs for the EOS when sample=SAR_TR_SCAN_CNT.SCAN_CNT.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SIMULT_FW_START_CTRL</name>
          <description>SAR simultaneous start control</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>FW_TRIGGER</name>
              <description>This field is used to simultaneously FW trigger two or more SARs.

&lt;0&gt;: Firmware trigger for SAR0
&lt;1&gt;: Firmware trigger for SAR1
&lt;2&gt;: Firmware trigger for SAR2
&lt;3&gt;: Firmware trigger for SAR3

If less than two bits are set, this field has no effect.

When firmware writes to this field it will trigger the next scan of enabled channels, hardware clears this bit when the scan started with this trigger is completed. If scanning continuously the trigger is ignored and hardware clears this bit after the next scan is done. This bit is also cleared when the SAR is disabled.  This field cannot be set when SAR_CLOCK_SEL.CLOCK_SEL =1.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CONTINUOUS</name>
              <description>This field is used to configure two or more SARs for continuous operation.

-0: Continuous mode disabled
-1: Continuously scan enabled channels, ignore triggers.

