RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_04.svd
&lt;0&gt;: Continuous Mode for SAR0
&lt;1&gt;: Continuous Mode for SAR1
&lt;2&gt;: Continuous Mode for SAR2
&lt;3&gt;: Continuous Mode for SAR3

If less than two bits are set, this field has no effect. This field cannot be set when SAR_CLOCK_SEL.CLOCK_SEL =1.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TR_OUT_CTRL</name>
          <description>SAR trigger out control</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SAR0_TR_OUT_SEL</name>
              <description>SAR0 Trigger Out Source Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>sar output trigger is set by SAR.SAMPLE_CTRL.EOS_DSI_OUT_EN condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_TRIGGER_LEVEL</name>
                  <description>sar output trigger is set by FIFO.CTRL.FIFO_LEVEL condition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAR1_TR_OUT_SEL</name>
              <description>SAR1 Trigger Out Source Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>sar output trigger is set by SAR.SAMPLE_CTRL.EOS_DSI_OUT_EN condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_TRIGGER_LEVEL</name>
                  <description>sar output trigger is set by FIFO.CTRL.FIFO_LEVEL condition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAR2_TR_OUT_SEL</name>
              <description>SAR2 Trigger Out Source Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>sar output trigger is set by SAR.SAMPLE_CTRL.EOS_DSI_OUT_EN condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_TRIGGER_LEVEL</name>
                  <description>sar output trigger is set by FIFO.CTRL.FIFO_LEVEL condition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAR3_TR_OUT_SEL</name>
              <description>SAR3 Trigger Out Source Select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>sar output trigger is set by SAR.SAMPLE_CTRL.EOS_DSI_OUT_EN condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFER_TRIGGER_LEVEL</name>
                  <description>sar output trigger is set by FIFO.CTRL.FIFO_LEVEL condition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TIMER</name>
          <description>Programmable Analog Subsystem</description>
          <addressOffset>0x00000100</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Timer trigger control register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x80000000</resetMask>
            <fields>
              <field>
                <name>ENABLED</name>
                <description>0=disabled, 1=enabled

Upon enable, the timer will immediately generate a trigger pulse (lasting for one clock cycle of the selected CONFIF.CLOCK_SEL) and will generate subsequent trigger pulses (again lasting one clock cycle) whenever the timer reaches terminal count.  If PERIOD.PER_VAL is set to 0, the timer trigger output will remain high as long as the timer is enabled.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Timer trigger configuration register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>CLOCK_SEL</name>
                <description>Select Clock source of the Timer</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLK_PERI</name>
                    <description>Timer clocked from CLK_PERI</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK_DPSLP</name>
                    <description>Timer clocked from CLK_DPSLP</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK_LF</name>
                    <description>Timer clocked from CLK_LF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TBD</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIOD</name>
            <description>Timer trigger period register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PER_VAL</name>
                <description>Actual timer period is PER_VAL+1 (1 to 65536).

Only non-zero PER_VAL are supported.  (i.e. PER_VAL=0 is considered invalid).</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>LPOSC</name>
          <description>LPOSC configuration</description>
          <addressOffset>0x00000200</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Low Power Oscillator control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x80000000</resetValue>
            <resetMask>0x80000000</resetMask>
            <fields>
              <field>
                <name>ENABLED</name>
                <description>Master enable for LPOSC oscillator.  This bit must be high at all times for all functions to work properly.  Hardware will automatically disable the LPOSC during DEEPSLEEP (unless DEEPSLEEP_MODE is set)</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Low Power Oscillator configuration register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>DEEPSLEEP_MODE</name>
                <description>LPOSC functionality while in DEEPSLEEP.  

If the ANA_PWR_CFG.DUTY_CYCLE_SAR_ACT_EN bit of a Deepsleep configured SAR is set, the DEEPSLEEP_MODE field for the LPOSC also applies to chip active mode (i.e. the LPOSC will get duty cycled in chip active mode if DEEPSLEEP_MODE=0 and DUTY_CYLE_SAR_ACT_EN=1 for all Deepsleep enabled SAR(s))</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DUTYCYCLED</name>
                    <description>LPOSC enabled by TIMER trigger</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALWAYS_ON</name>
                    <description>LPOSC always on in deepsleep</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADFT</name>
            <description>Retention, Hidden</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>ADFT_SEL</name>
                <description>ADFT selection for LPOSC.
0: DFT disabled
1: Measure Vdo; expect ~0.8V
2: Measure Ibias_ptat; expect ~250nA
3: Measure Ibias_ctat; expect ~550nA</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>256</dimIncrement>
          <name>FIFO[%s]</name>
          <description>FIFO configuration</description>
          <addressOffset>0x00000300</addressOffset>
          <register>
            <name>CTRL</name>
            <description>FIFO control register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x80000000</resetMask>
            <fields>
              <field>
                <name>ENABLED</name>
                <description>Enable for SAR FIFO functionality.  If CONFIG.CHAIN_TO_NXT is set, the ENABLED bit of the NEXT FIFO is set when FIFO[0] is enabled.
- 0: FIFO disabled
- 1: FIFO enabled</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>FIFO configuration register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>CHAN_ID_EN</name>
                <description>channel number (ID) enable bit

-0: CHAN_ID field in RD_DATA is disabled.  A read from RD_DATA will result in (4'b0,16'b RESULT)

